//------------------------------------------------------------------------------
/**
	\file	BuildMenu.cs

	Copyright (c) 2019, BoYue. All rights reserved.

	<PRE>

	模块名称：<文件所属的模块名称>
	文件名称：BuildMenu.cs
	摘    要：<描述该文件实现的主要功能>

	当前版本：1.0
	建立日期：2019/12/11
	作    者：SYSTEM
	电子邮件：SYSTEM@BoYue.com
	备    注：<其它说明>

	</PRE>
*/
//------------------------------------------------------------------------------
// Using
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Class
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//	BuildMenu.cs
//------------------------------------------------------------------------------

using System.IO;
using UnityEditor;
using UnityEngine;

public class BuildMenu : EditorWindow
{
    /// <summary>
    /// LZ4重新压缩。使用资源的时候不需要整体解压。在下载的时候可以使用LZMA算法，一旦它被下载了之后，它会使用LZ4算法保存到本地上
    /// 使用LZ4压缩，压缩率没有LZMA高，但是我们可以加载指定资源而不用解压全部 
    /// 注意使用LZ4压缩，可以获得可以跟不压缩想媲美的加载速度，而且比不压缩文件要小.
    /// </summary>
    //----------------------------------------------------------------------------
    [MenuItem("Assets/Export/全部打包/Windows64", false, 1001)]
    [MenuItem("AssetBundle/全部打包/Windows64", false, 1000)]
    public static void BuildAllAssetBundleForWindows64()
    {
        ExportAssetBundle.CreateAssetBundleAll_Win64();
    }

}
